NSCameraUsageDescription = "سىنلىق چاقىرىقتا كامىرا ئىشلىتىلدۇ";
NSMicrophoneUsageDescription = "مىكروفون ئاۋازلىق ۋە سىنلىق سۆزلىشىشتە ئىشلىتىلىدۇ";
NSPhotoLibraryUsageDescription = "ئۈسكۈنىڭىزدىكى رەسىم ۋە سىنلارنى ھەمبەھىرلەش ئۈچۈن رەسىم ئامبىرى زىيارەت قىلىش لازىم";
NSContactsUsageDescription = "ئادرېس دەپتىرىڭىزنى مۇلازىمېتىرىڭىزدىكى ئالاقىداشلار بىلەن ماسلاشتۇرۇش ئۈچۈن ئالاقىلىشىش لازىم";
NSLocationWhenInUseUsageDescription = "ئورنىڭىزنى باشقىلار بىلەن ئورتاقلىشىش كېرەك";
NSSpeechRecognitionUsageDescription = "ئۈسكۈنىدە تونۇش ئارقىلىق ئاۋازلىق ئۇچۇرنى تېكىستكە كۆچۈرۈش ئۈچۈن نۇتۇق تونۇش ئىقتىدارىغا ئېھتىياجلىق";
